<!-- dflook/terraform-github-actions {"workspace":"repository_dispatch-test","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"f10666b336b1289fa010863c2eff0bf54daf9db7a7a836c67864c0171839155f","plan_job_ref":"Job Test plan target and replace #347 at https://github.com/dflook/terraform-github-actions/actions/runs/5391053569","plan_hash":"2ab321a1d5cdfb954d2906e84fb7de4e12f47cc3bed358ea0396b5f05a62f46e","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __repository_dispatch-test__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
  + resource "random_string" "foreach" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + foreach = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #347](https://github.com/dflook/terraform-github-actions/actions/runs/5391053569)